app/controllers/posts_controller.rb

INSERT INTO "posts" ("image", "active", "account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image", "favor_preview_1-8.jpg"], ["active", true], ["account_id", 1], ["created_at", "2020-02-11 12:36:26.430278"], ["updated_at", "2020-02-11 12:36:26.430278"]]
---
  def create
    @post = Post.new(post_params)
    @post.account_id = current_account.id if account_signed_in?
    if @post.save