app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "about" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["about", "123"], ["updated_at", "2020-02-10 12:45:46.068812"], ["id", 14]]

  def add_about
    #puts "\n\n params: #{params} \n\n"
    #puts "#{user_params[:about]}"
    #puts "#{@user}"
    # current_user.
    @user.update_attributes(about: user_params[:about])
---
UPDATE "users" SET "about" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["about", "qwe123"], ["updated_at", "2020-02-10 14:56:27.345002"], ["id", 14]]

  def edit_about
    @user = current_user
    @user.update_attributes(about: params[:user][:about]) if params[:user]
---
UPDATE "users" SET "about" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["about", "1231251251333"], ["updated_at", "2020-02-10 14:25:23.919663"], ["id", 14]]

  def set_user
    puts "\n\n params: #{params} \n\n"
    @user = User.find(params[:id] || params[:user][:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]