app/models/user.rb

SELECT  "users".* FROM "users" WHERE (username = 'qwe' OR email = 'qwe') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE (username = 'oleg' OR email = 'oleg') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def self.find_for_authentication(conditions)
    login = conditions.delete(:login)
    where(conditions).where(["username = :value OR email = :value", { :value => login }]).first