app/views/accounts/profile.html.haml

    .col-8.text-left
      %h1= @account.full_name
      .profile-stats #{@account.posts.count} posts
      .profile-stats #{@account.total_followers} followers
      .profile-stats #{@account.total_following} following
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."account_id" = $1  [["account_id", 1]]